<h1>C&oacute;digo de Conduta para Contribuintes do Sul Seminovos</h1>

<h2>Nossa promessa</h2>

<p>No interesse de fomentar um ambiente aberto e acolhedor, n&oacute;s, como contribuintes e mantenedores,
    comprometemo-nos a tornar a participa&ccedil;&atilde;o em nosso projeto e nossa comunidade uma experi&ecirc;ncia
    livre de ass&eacute;dio para todos, independentemente da idade, tamanho do corpo, defici&ecirc;ncia, etnia,
    identidade e express&atilde;o de g&ecirc;nero, n&iacute;vel de experi&ecirc;ncia, educa&ccedil;&atilde;o, status
    socioecon&ocirc;mico, nacionalidade, apar&ecirc;ncia pessoal, ra&ccedil;a, religi&atilde;o ou identidade e
    orienta&ccedil;&atilde;o sexual.</p>

<h2>Nossos padr&otilde;es</h2>

<p>Exemplos de comportamento que contribuem para a cria&ccedil;&atilde;o de um ambiente positivo incluem:</p>

<ul>
    <li>Uso de linguagem acolhedora e inclusiva</li>
    <li>Respeito &agrave;s diferentes perspectivas e experi&ecirc;ncias</li>
    <li>Aceitar cr&iacute;ticas construtivas com eleg&acirc;ncia</li>
    <li>Focar no que &eacute; melhor para a comunidade</li>
    <li>Mostrar empatia para com outros membros da comunidade</li>
</ul>

<p>Exemplos de comportamento inaceit&aacute;vel pelos participantes incluem:</p>

<ul>
    <li>Uso de linguagem ou imagens sexualizadas e aten&ccedil;&atilde;o ou avan&ccedil;os sexuais indesejados</li>
    <li>Coment&aacute;rios de trolling, insultuosos/desrespeitosos e ataques pessoais ou pol&iacute;ticos</li>
    <li>Ass&eacute;dio p&uacute;blico ou privado</li>
    <li>Publicar informa&ccedil;&otilde;es privadas de outros, como endere&ccedil;o f&iacute;sico ou eletr&ocirc;nico,
        sem permiss&atilde;o expl&iacute;cita</li>
    <li>Outras condutas que poderiam ser razoavelmente consideradas inadequadas em um ambiente profissional</li>
</ul>

<h2>Nossas responsabilidades</h2>

<p>Os mantenedores do projeto s&atilde;o respons&aacute;veis por esclarecer os padr&otilde;es de comportamento
    aceit&aacute;vel e devem tomar medidas corretivas adequadas e justas em resposta a qualquer inst&acirc;ncia de
    comportamento inaceit&aacute;vel.</p>

<p>Os mantenedores do projeto t&ecirc;m o direito e a responsabilidade de remover, editar ou rejeitar
    coment&aacute;rios, commits, c&oacute;digo, edi&ccedil;&otilde;es wiki, issues e outras contribui&ccedil;&otilde;es
    que n&atilde;o estejam alinhadas a este C&oacute;digo de Conduta, ou de banir tempor&aacute;ria ou permanentemente
    qualquer colaborador por comportamentos que considerem inadequados, amea&ccedil;adores, ofensivos ou prejudiciais.
</p>

<h2>Aplica&ccedil;&atilde;o</h2>

<p>Casos de abuso, ass&eacute;dio ou qualquer outro comportamento inaceit&aacute;vel podem ser relatados entrando em
    contato com a equipe do projeto em hello@itjunior.dev. Todas as queixas ser&atilde;o analisadas e investigadas e
    resultar&atilde;o em uma resposta considerada necess&aacute;ria e adequada &agrave;s circunst&acirc;ncias. A equipe
    do projeto &eacute; obrigada a manter a confidencialidade em rela&ccedil;&atilde;o ao relator de um incidente. Mais
    detalhes sobre pol&iacute;ticas de aplica&ccedil;&atilde;o espec&iacute;ficas podem ser postadas separadamente.</p>

<p>Os mantenedores do projeto que n&atilde;o seguirem ou aplicarem o C&oacute;digo de Conduta de boa f&eacute; podem
    enfrentar repercuss&otilde;es tempor&aacute;rias ou permanentes, determinadas por outros membros da lideran&ccedil;a
    do projeto.</p>

<p>Este C&oacute;digo de Conduta &eacute; adaptado do <a
        href="https://www.contributor-covenant.org/version/1/4/code-of-conduct.html" target="_new">Contributor
        Covenant</a>, vers&atilde;o 1.4, dispon&iacute;vel em <a
        href="https://www.contributor-covenant.org/pt-br/version/1/4/code-of-conduct.html"
        target="_new">https://www.contributor-covenant.org/pt-br/version/1/4/code-of-conduct.html</a></p>